----- 2.1 -----
----- Напишете заявка, която извежда номер на модел, честота на процесора (speed) 
----- и размер на диска (hd) за всички компютри с цена по-малка от 1200 долара. 
----- Задайте псевдоними за атрибутите честота и размер на диска, съответно MHz и GB
SELECT model, speed AS MHz, hd AS GB FROM pc WHERE price < 1200;

----- 2.2 -----
----- Напишете заявка, която извежда моделите и цените в евро на всички лаптопи.
----- Нека приемем, че в базата цените се съхраняват в долари, а курсът е 1.1 долара
----- за евро. Да се изведат първо най-евтините лаптопи
SELECT model, price/1.1 as EUR from laptop ORDER BY price ASC;

----- 2.3 -----
----- Напишете заявка, която извежда номер на модел, размер на паметта, размер на
----- екран за лаптопите, чиято цена е по-голяма от 1000 долара
SELECT model, hd, screen FROM laptop WHERE price > 1000;

----- 2.4 -----
----- Напишете заявка, която извежда всички цветни принтери
SELECT * FROM printer WHERE color = 'y';

----- 2.5 -----
----- Напишете заявка, която извежда номер на модел, честота и размер на диска за
----- тези компютри с DVD 12x или 16x и цена по-малка от 2000 долара
SELECT model, speed, hd FROM pc WHERE price < 2000 AND (cd = '12x' OR cd = '16x');

----- 2.6 -----
----- Нека рейтингът на един лаптоп се определя по следната формула: 
----- честота на процесора + размер на RAM паметта + 10*размер на екрана.
----- Да се изведат кодовете, моделите и рейтингите на всички лаптопи. 
----- Резултатът да бъде подреден така, че първо да бъдат лаптопите с най-висок рейтинг,
----- а продукти с еднакъв рейтинг да бъдат подредени по код.
SELECT code, model, speed + ram + 10*screen AS rating
FROM laptop
ORDER BY rating DESC, code ASC;






